{
    "title": "CSE 6429 - Advanced Studies in Computer Architecture\n",
    "description": "Advanced-level topics in computer architecture. Repeatable to a maximum of 24 cr hrs or 8 completions. This course is graded S/U. Class Notes: Objectives: During the last several years, networking and computing technologies are undergoing rapid growth and leading to low-cost, high-performance, and commodity computers and networking components (switches, routers, and adapters). Significant advances are also taking place for GPGPUs, Accelerators and SSDs. These advances are giving rise to a new computing paradigm known as Network-Based Computing where computers distributed over LAN and WAN can be used together to provide computing environments for a wide variety of application domains (such as scientific computing, enterprise computing, cloud computing). Such systems are typically connected over high performance interconnections such as InfiniBand and 10/40 GigE Ethernet. Several challenging research issues have to be addressed in designing such network-based computing systems. These include issues related to interprocessor communication, collective communication, synchronization, low-overhead messaging layers and communication protocols with OS bypass, NIC-level support, flow control mechanisms, reliability, Quality of Service (QoS), high performance implementation of emerging communication standards (such as InfiniBand and 10/40GigE iWARP, RoCE), supporting popular programming models (MPI, PGAS and Hybrid), high performance file systems and I/O, cloud computing environments (such as Memcached, HBase, Hadoop and MapReduce), etc. A large number of state-of-the-art research projects are currently being undertaken by the group along these directions. By participating in this seminar, the student can join in carrying out interesting research projects on the above issues and evaluate them on the large-scale experimental testbed available in the network-based computing laboratory. Prerequisites: Permission of instructor Materials: Papers from the literature + hands-on research projects on the experimental testbed in the network-based computing laboratory.\n",
    "credits": 3.0,
    "attributes": null,
    "professors": "Dhabaleswar Panda,Christopher Stewart,Mircea-Radu Teodorescu \n",
    "open_time": "Spring 2019, Fall 2018, Spring 2018, Fall 2017\n",
    "average_size": 28,
    "average_sections": 3
}